/* for

for(початковий стан; умова, за якою цикл повторюється; зміна лічильника на кожній ітерації) {
    блок коду, який повторюється
}

Початковий стан - початковке значення для лічильника
*/

// Задача: вивести 10 консоль.логів

for (let i = 0; i < 10; i += 3) {
  console.log(i);
}

/*
Задача: написати функцію, яка обчислює факторіал переданого їй числа, результат роботи функції вивести на консоль

Факторіал - це
5! = 1*2*3*4*5 = 120
10! = 1*2*3*4*5*6*7*8*9*10

Якщо число від'ємне - поверніть з функції помилку
Якщо число = 0, або = 1 - поверніть з функції 1
Знаходимо факторіал...=)
*/

function factorial(n) {
  if (n >= 0) {
    let result = 1;
    while (n) {
      result *= n--;
    }
    console.log(result);
  } else if (n < 0) {
    console.log("Виникла помилка");
  }
}

factorial(Number(prompt("Введіть число: ")));
