/* Задача 1
Ми маємо змінну яка вказує на кількість хвилин в годині.
Визначити, в якій чверті години знаходиться ця кількість хвилин.

Якщо кількість хвилин попадає в першу чверть години - вивести на консоль "перша чверть".
Якщо кількість хвилин попадає в другу чверть години - вивести на консоль "друга чверть".
Якщо кількість хвилин попадає в третю чверть години - вивести на консоль "третя чверть".
Якщо кількість хвилин попадає в четверту чверть години - вивести на консоль "четверта чверть".
*/

const min = 32;

if (min <= 15) {
  console.log(min + " хвилин(и) - перша чверть");
} else if (min > 15 && min <= 30) {
  console.log(min + " хвилин(и) - друга чверть");
} else if (min > 30 && min <= 45) {
  console.log(min + " хвилин(и) - третя чверть");
} else if (min > 45 && min < 60) {
  console.log(min + " хвилин(и) - четверта чверть");
}

/* Задача 2
Ви зберігаєте у змінній рік.
Потрібно визначити, чи є цей рік високосним.
Примітка. Рік є високосним, якщо його номер кратний 4, 
але не кратний 100, АБО якщо він кратний 400.
*/

let year = 2024;

if ((year % 4 === 0 && year % 100 > 0) || year % 400 === 0) {
  console.log(year + " - високосний рік");
} else {
  console.log(year + " - НЕ високосний рік");
}

/* Задача 3.
У вас є задане початкове і кінцеве значення діапазону, і також певне число.
Вам потрібно визначити, чи входить це число в заданий діапазон, чи ні.
Якщо число знаходить між початковим і кінцевим значенням діапазону (включно), вивести "В діапазоні".
В іншому випадку вивести "Поза діапазоном", оскільки число знаходиться поза початковим та кінцевим значенням.
*/

const num = 60;
const left = 40;
const right = 60;

if (num >= left && num <= right) {
  console.log(num + " - знаходиться в діапазоні");
} else if (num < left || num > right) {
  console.log(num + " - знаходиться поза діапазоном");
}

/*Задача 4.
Козак Вус проводить змагання з програмування, в якому беруть участь n людей.
Він вирішив нагородити їх усіх ручками та блокнотами.
Відомо, що Ус має рівно m ручок і k блокнотів.
Визначте, чи може Козак Вус нагородити всіх учасників, даючи кожному з них щонайменше по одній ручці і одному блокноту.
*/

const n = 15;
const m = 17;
const k = 15;

if (m >= n && k >= n) {
  console.log("Козак Вус може нагородити всіх учасників");
} else if (m < n || k < n) {
  console.log("Козак Вус НЕ може нагородити всіх учасників");
}

/*Задача 5.

Ви є організатором розважальної програми і вам потрібно розподілити вхідні квитки на основі віку відвідувачів. 
Вхідні квитки мають різні ціни в залежності від віку відвідувачів. 
Вам потрібно реалізувати таку логіку, яка в залежності від віку відвідувача повертає вартість його квитка згідно наступних умов:

- Діти до 6 років: безкоштовний вхід
- Діти від 6 до 12 років (включно): квиток коштує $10
- Дорослі від 12 років і старше: квиток коштує $20

Якщо дорослий надає документ, що підтверджує його право на пільги, то такому дорослому надається знижка 50% (знижка для всіх дорослих фіксована, незалежно від виду пільги).
*/

const age = 15;
const benefitPresence = true;

if (age < 0 || typeof age !== "number") {
  console.log("Некоректний вік користувача");
} else if (age < 6) {
  console.log("Вхід безкоштовний");
} else if (age >= 6 && age < 12) {
  console.log("Квиток коштує 10$");
} else if (age >= 12 && benefitPresence === false) {
  console.log("Квиток коштує 20$");
} else if (age >= 12 && benefitPresence) {
  console.log("Квиток коштує 10$");
}
