// array.concat - використовується для об'єднанання двох або більше масивів у новий масив
// array.fill - використовується для заповнення всіх елементів масиву певним одним значенням
// array.includes - використовується для перевірки наявності певного значення у масиві
// array.indexOf - використовується для отримання першого входження певного значення у масиві
// array.join - використовується для створення рядка, об'єднуючи всі елементи масиву
// array.push - використовується для додавання одного або кількох елементів у кінець масиву
// array.pop - використовується для видалення останього елементу у масиві
// array.shift - використовується для видалення першого елементу з посатку масиву
// array.unshift - використовується для додавання одного або декількох елементів на початок масиву
// array.reverse - використовується для зміни порядку елментів порядку у масиві на протилежний
// Методи, які змінюють вихідний масив - мутуючі методи
// Методи, які НЕ змінюють вихідний масив - немутуючі методи (більшість методів масиву)

// array.slice - виокристовується для створення нового масиву, який складається тільки з якоїсь певної частини вихідного масиву
// array.slice([start = 0], [end = array.length-1]);
// [start; end)

// Копіює масив з індексу M (включно) до індексу N (не включно)
// arr.slice(M, N);

const arr1 = [1, 2, 3, 4, 5, 6, 7, 8];
const arr2 = arr1.slice(2, 7);
// console.log(arr2);

const users = [
  {
    name: "John",
    lastName: "Doe",
  },
  {
    name: "Jane",
    lastName: "Doe",
  },
  {
    name: "Jack",
    lastName: "Dosh",
  },
];

const newUsers = users.slice(); // newUsers - поверхнева копія
const upUsers = newUsers.slice(); // upUsers - поверхнева копія з поверхневої копії

