// if - якщо
// if - оператор логічної умови у js
/* if - спосіб перевірити, 
чи виконується певна умова, і в залежності від цього зробити певні дії
або виконати певний код 
*/

// Якщо сонце сходить (умова є істиною) - ви плануєте піти на прогулянку
// Якщо сонце не сходить (умова є хибною) - ви залишаєтеся вдома

/*
Синтаксис if:

if(лоічга операції, результатом якої буде тип Bolean) {
    блок коду, який буде виконуватись, якщо умова = true (істина) 
}
*/

if(2 + 3 === 5) {
    console.log('Числа рівні між собою') // виконається якщо умова = true
}

// if-else
// elde - інакше (в протилежному випадку)

/*
Синаксис if-else:

if(лоічга операції, результатом якої буде тип Bolean) {
    блок коду, який буде виконуватись, якщо умова = true (істина) 
} else {
    блок коду, який буде виконуватись, якщо умова = false (хибна)
}
*/

if(2 + 2 === 5) {
    console.log('Числа рівні між собою') // виконається якщо умова = true
} else {
    console.log('Числа не рівні між собою') // виконається якщо умова = false
}