// Функціїї (Functions)
// Функція (підпрограма - старі мови програмування) - блок коду, який виконує певні дії при виклику.
// Функція може приймати аргументи - значення, які передаються у фунцію.
// Функція може використовувати аргументи у своїй роботі.
// Фукнція може повертати значення (або не повертати).
// Функція - фрагмент програмного коду, до якого можна звернутись з іншого місця програми.
/* 
Синтаксис функції 

Як оголосити функцію?

function ім'яФункції(аргумент1, аргумент 2) {
  тіло функції
}
*/

// Задача: написати функцію, яка буде приймати ім'я користувача:рядок і буде вітатись з користувачем

function greetingUser(userName) {
  // userName - абстракція, на якій ми зав'язуємо логіку робот функції
  // userName - формальний параметр
  console.log('Hello, ' + userName);
}

// Використання функції
// Параметри, які передаються при виклику функції - фактичні параметри
greetingUser('Alex'); // 'Alex' - агумент функції, фактичний параметр
greetingUser('John');
greetingUser('Sam');
greetingUser('Solar');