/* Задача 1

1. З масиву [1, 2, 3, 4, 5] зробіть масив [1, 4, 5]
2. З масиву [1, 2, 3, 4] запишіть в новий масив [2, 3, 4] // тут потрібно splice передати тільки start
3. З масиву [1, 2, 3, 4, 5] зробіть масив [1, 'w', 'tr-td', 2, 3, 4, 'vv', 5, 'aa']
*/

arr1 = [1, 2, 3, 4, 5];
arr1.splice(1, 2); // [1, 4, 5]

arr2 = [1, 2, 3, 4];
const arr3 = arr2.slice(1); // [2, 3, 4];

arr4 = [1, 2, 3, 4, 5];
arr4.splice(1, 0, "w", "tr-td");
arr4.splice(6, 0, "vv");
arr4.push("aa");

// [1, 'w', 'tr-td', 2, 3, 4, 'vv', 5, 'aa']

/* Задача 2 

Напишіть функцію, яка приймає масив і перевіряє, чи є в масиві два однакових елемента поспіль.
Масив приймаємо як аргумент функції,
функція повертає true, якщо є два однакових елемента поспіль.
функція повертає false, якщо двох однакових елементів поспіль у масиві немає

[1, 2, 3, 4, 5] // false
[1, 2, 2, 3, 4] // true

Суть вирішення:
потрібно переглянути масив циклом;
на кожній ітерації циклу порівнювати поточне число з наступним числом у масиві ->
-> якщо число поточне і число наступне співпали - повертаємо true з функції
-> якщо число поточне і число наступне НЕ співпали - нічого не робимо

array[i] - поточне число
array[i + 1] - наступне число

*/

array1 = [1, 2, 3, 4, 5];
array2 = [1, 2, 3, 3, 5];

function sameElements(array) {
  for (let i = 0; i < array.length -1; i++) {
    if (array[i] === array[i + 1]) {
      return true;
    }
  }
  return false
}

console.log(sameElements(array1));
console.log(sameElements(array2));
