// дужки "()" - оператор виклику функції 

// Інтерфейс - місце взаємодії між користувачем та системою 

// Hello world! - не можна писати будь-що, це не буде виконано браузером. 
// При програмуванні потрібно дотримуватись певних правил

// -однорядковий коментар

/*  - багатрядковий коментар
Рядок 1
Рядок 2
Рядок 3
*/

// Кожниц тип даних по своєму виділяється у консоль.лог

console.log(false); // boolean
console.log('This is text'); // string
console.log(50); // number
console.log(null);
console.log(undefined);
console.log(5n); // bigint