/* Loops - цикли

while (умова) {
    код, який повторюється, поки умова = true
}

Задача: написати у консолі 10 разів цифру 1

while(кількіть консоль логів < 10) {
    console.log(1);
    кількість консоль логів збільшується ++;
}
*/

// let iterator = 0; // лічильник консоль логів

// // Ітерація - 1 прохід циклу (коло)

// while (iterator < 10) {
//   console.log(1);
//   iterator++;
// }

// // Нескінченний цикл

// while (true) {
//   console.log("Не вірно");
//   break;
// }

// // Задача: зробити 10 повторів (ітерацій) циклу і вивести на консоль парні значення лічильника

let i = 0;
while (i < 10) {
  if (i % 2 === 0) {
    console.log(i);
  }

  i += 2;
}

/* Дано правильний пароль = qwerty1234

Запитуйте у користувача пароль через prompt, поки пароль, який вводить користувач, не співпаде з тим еталонним паролем, який лежить у змінній */

const correctPassword = "qwerty1234";

while (true) {
  password = prompt("Введіть пароль: ");
  if ((password === correctPassword)) {
    break;
  }
}
