// && ("і")
// && - бінарний оператор, опвертає boolean
// && - повертає істину тільки тоді, коли обидві операнди є істинними
// в якості операндів виступають умови
// якщо обидві умови = true - && повертає true
// якщо хоча б одна з умова буде false - && повертає false

/*Задача: перевірити вік людини і наявність права на управління авто.  
На підставі цього зробити висновок: чи може людина керувати автомобілем чи ні.

Базові правила:
Керування авто мождливе з 18 років + для цього потрібне водійське посвідчення 
*/

const age = 39;
const hasLicense = true;

if (age >= 18 && hasLicense === true) {
    console.log('Ви можете керувати автомобілем');
} else if (age < 18) {
    console.log('Ви не модете керувати авомобілем, почекайте трохи');
} else if (hasLicense === false); {
    console.log('У вас немає посвідчення водія');
} 