// Оператори: унарні, бінарні, тернарні

// Тернарний опертатор - потребує 3-х операндів

// Тернарний оператор дозволяє вибрати 1 з 2 операндів на основі заданої умови.

// let result = умова ? операнд1 : операнд2;

// операнд1 - значення для змінної result, якщо умова буде true
// операнд2 - значення для змінної result, якщо умова буде false

const age = 9;

// Задача: реалізувати обмеження, щоб особи, які не досягли 18 років не могли купувати алкогольні та тютюнові вироби

const isAdult = age < 18 ? "not adult" : "adult";

console.log(isAdult);
